---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderParallelLegsFailure
source: html/045b2767-e1ce-2a72-28fe-a589c4a831e7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.WinderParallelLegsFailure Property

Two consecutive legs are parallel.

## Syntax (C#)
```csharp
public static FailureDefinitionId WinderParallelLegsFailure { get; }
```